TAL_INT_GIT/Sample Data/Nupco/PODetails/PoDetails input Soap request/PoDetails input Soap request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZmmGetPoDataV2>
         <!--Optional:-->
         <IEbeln>?</IEbeln>
         <!--Optional:-->
         <IShipTo>?</IShipTo>
         <!--Optional:-->
         <Plant>?</Plant>
         <!--Optional:-->
         <PoDet>
            <!--Zero or more repetitions:-->
            <item>
               <NupcoPoNo>?</NupcoPoNo>
               <NupcoPoItem>?</NupcoPoItem>
               <Plant>?</Plant>
               <NupcoMaterial>?</NupcoMaterial>
               <PoDate>?</PoDate>
               <NupcoMaterialDescription>?</NupcoMaterialDescription>
               <OrderQuantity>?</OrderQuantity>
               <OpenQty>?</OpenQty>
               <OrderUnit>?</OrderUnit>
               <PriceUnit>?</PriceUnit>
               <NetOrderPrice>?</NetOrderPrice>
               <NetOrderValue>?</NetOrderValue>
               <Currency>?</Currency>
               <StorageLocation>?</StorageLocation>
               <VendorNo>?</VendorNo>
               <VendorName>?</VendorName>
               <Status>?</Status>
               <TradeCode>?</TradeCode>
               <PoDeliveryDate>?</PoDeliveryDate>
               <TenderNo>?</TenderNo>
               <CustomerMaterialCode>?</CustomerMaterialCode>
               <CustNo>?</CustNo>
               <CustNoEkpoKunnr>?</CustNoEkpoKunnr>
               <CustName>?</CustName>
               <CustReference>?</CustReference>
               <MohPoNo>?</MohPoNo>
               <SoRef>?</SoRef>
               <SoRefItem>?</SoRefItem>
               <DeliveryCompleted>?</DeliveryCompleted>
               <DeletionIndicator>?</DeletionIndicator>
               <ItemStatus>?</ItemStatus>
               <LastUpdate>?</LastUpdate>
               <QtyInv>?</QtyInv>
               <ValueInv>?</ValueInv>
               <QtyInvOpen>?</QtyInvOpen>
               <ValueInvOpen>?</ValueInvOpen>
               <ReleaseGroup>?</ReleaseGroup>
               <ReleaseStrategy>?</ReleaseStrategy>
               <ReleaseInd>?</ReleaseInd>
               <ReleaseState>?</ReleaseState>
               <SubjToRel>?</SubjToRel>
               <PoType>?</PoType>
            </item>
<item>
               <NupcoPoNo>?</NupcoPoNo>
               <NupcoPoItem>?</NupcoPoItem>
               <Plant>?</Plant>
               <NupcoMaterial>?</NupcoMaterial>
               <PoDate>?</PoDate>
               <NupcoMaterialDescription>?</NupcoMaterialDescription>
               <OrderQuantity>?</OrderQuantity>
               <OpenQty>?</OpenQty>
               <OrderUnit>?</OrderUnit>
               <PriceUnit>?</PriceUnit>
               <NetOrderPrice>?</NetOrderPrice>
               <NetOrderValue>?</NetOrderValue>
               <Currency>?</Currency>
               <StorageLocation>?</StorageLocation>
               <VendorNo>?</VendorNo>
               <VendorName>?</VendorName>
               <Status>?</Status>
               <TradeCode>?</TradeCode>
               <PoDeliveryDate>?</PoDeliveryDate>
               <TenderNo>?</TenderNo>
               <CustomerMaterialCode>?</CustomerMaterialCode>
               <CustNo>?</CustNo>
               <CustNoEkpoKunnr>?</CustNoEkpoKunnr>
               <CustName>?</CustName>
               <CustReference>?</CustReference>
               <MohPoNo>?</MohPoNo>
               <SoRef>?</SoRef>
               <SoRefItem>?</SoRefItem>
               <DeliveryCompleted>?</DeliveryCompleted>
               <DeletionIndicator>?</DeletionIndicator>
               <ItemStatus>?</ItemStatus>
               <LastUpdate>?</LastUpdate>
               <QtyInv>?</QtyInv>
               <ValueInv>?</ValueInv>
               <QtyInvOpen>?</QtyInvOpen>
               <ValueInvOpen>?</ValueInvOpen>
               <ReleaseGroup>?</ReleaseGroup>
               <ReleaseStrategy>?</ReleaseStrategy>
               <ReleaseInd>?</ReleaseInd>
               <ReleaseState>?</ReleaseState>
               <SubjToRel>?</SubjToRel>
               <PoType>?</PoType>
            </item>

         </PoDet>
         <!--Optional:-->
         <Sloc>?</Sloc>
         <!--Optional:-->
         <Vendor>?</Vendor>
         <!--Optional:-->
         <Zdate>?</Zdate>
         <!--Optional:-->
         <Ztime>?</Ztime>
      </urn:ZmmGetPoDataV2>
   </soapenv:Body>
</soapenv:Envelope>